Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وإذا صرفت أبصارهم تلقاء أصحاب النار قالوا ربنا لا تجعلنا مع القوم الظالمين
en: And when their eyes are turned toward the dwellers of the Fire, they say: Our Lord! Place us not with the wrong-doing folk.

source: ونادى أصحاب الأعراف رجالا يعرفونهم بسيماهم قالوا ما أغنى عنكم جمعكم وما كنتم تستكبرون
en: And the dwellers on the Heights call unto men whom they know by their marks, (saying): What did your multitude and that in which ye took your pride avail you?

source: أهؤلاء الذين أقسمتم لا ينالهم الله برحمة ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون
en: Are these they of whom ye swore that Allah would not show them mercy? (Unto them it hath been said): Enter the Garden. No fear shall come upon you nor is it ye who will grieve.

source: ونادى أصحاب النار أصحاب الجنة أن أفيضوا علينا من الماء أو مما رزقكم الله قالوا إن الله حرمهما على الكافرين
en: And the dwellers of the Fire cry out unto the dwellers of the Garden: Pour on us some water or some wherewith Allah hath provided you. They say: Lo! Allah hath forbidden both to disbelievers (in His guidance),

source: الذين اتخذوا دينهم لهوا ولعبا وغرتهم الحياة الدنيا فاليوم ننساهم كما نسوا لقاء يومهم هذا وما كانوا بآياتنا يجحدون
en: Who took their religion for a sport and pastime, and whom the life of the world beguiled. So this day We have forgotten them even as they forgot the meeting of this their Day and as they used to deny Our tokens.

source: ولقد جئناهم بكتاب فصلناه على علم هدى ورحمة لقوم يؤمنون
en: Verily We have brought them a Scripture which We expounded with knowledge, a guidance and a mercy for a people who believe.

source: هل ينظرون إلا تأويله يوم يأتي تأويله يقول الذين نسوه من قبل قد جاءت رسل ربنا بالحق فهل لنا من شفعاء فيشفعوا لنا أو نرد فنعمل غير الذي كنا نعمل قد خسروا أنفسهم وضل عنهم ما كانوا يفترون
en: Await they aught save the fulfilment thereof? On the day when the fulfilment thereof cometh, those who were before forgetful thereof will say: The messengers of our Lord did bring the Truth! Have we any intercessors, that they may intercede for us? Or can we be returned (to life on earth), that we may act otherwise than we used to act? They have lost their souls, and that which they devised hath failed them.

source: إن ربكم الله الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يغشي الليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين
en: Lo! your Lord is Allah Who created the heavens and the earth in six Days, then mounted He the Throne. He covereth the night with the day, which is in haste to follow it, and hath made the sun and the moon and the stars subservient by His command. His verily is all creation and commandment. Blessed be Allah, the Lord of the Worlds!

source: ادعوا ربكم تضرعا وخفية إنه لا يحب المعتدين
en: (O mankind!) Call upon your Lord humbly and in secret. Lo! He loveth not aggressors.

source: ولا تفسدوا في الأرض بعد إصلاحها وادعوه خوفا وطمعا إن رحمت الله قريب من المحسنين
en: Work not confusion in the earth after the fair ordering (thereof). and call on Him in fear and hope. Lo! the mercy of Allah is nigh unto the good.

source: وهو الذي يرسل الرياح بشرا بين يدي رحمته حتى إذا أقلت سحابا ثقالا سقناه لبلد ميت فأنزلنا به الماء فأخرجنا به من كل الثمرات كذلك نخرج الموتى لعلكم تذكرون
en: And He it is Who sendeth the winds as tidings heralding His mercy, till, when they bear a cloud heavy (with rain), We lead it to a dead land, and then cause water to descend thereon and thereby bring forth fruits of every kind. Thus bring We forth the dead. Haply ye may remember.

source: والبلد الطيب يخرج نباته بإذن ربه والذي خبث لا يخرج إلا نكدا كذلك نصرف الآيات لقوم يشكرون
en: As for the good land, its vegetation cometh forth by permission of its Lord; while as for that which is bad, only the useless cometh forth (from it). Thus do We recount the tokens for people who give thanks.

source: لقد أرسلنا نوحا إلى قومه فقال يا قوم اعبدوا الله ما لكم من إله غيره إني أخاف عليكم عذاب يوم عظيم
en: We sent Noah (of old) unto his people, and he said: O my people! Serve Allah. Ye have no other Allah save Him. Lo! I fear for you the retribution of an Awful Day.

source: قال الملأ من قومه إنا لنراك في ضلال مبين
en: The chieftains of his people said: Lo! we see thee surely in plain error.

source: قال يا قوم ليس بي ضلالة ولكني رسول من رب العالمين
en: He said: O my people! There is no error in me, but I am a messenger from the Lord of the Worlds.

source: أبلغكم رسالات ربي وأنصح لكم وأعلم من الله ما لا تعلمون
en: I convey unto you the messages of my Lord and give good counsel unto you, and know from Allah that which ye know not.

source: أوعجبتم أن جاءكم ذكر من ربكم على رجل منكم لينذركم ولتتقوا ولعلكم ترحمون
en: Marvel ye that there should come unto you a Reminder from your Lord by means of a man among you, that he may warn you, and that ye may keep from evil, and that haply ye may find mercy.

source: فكذبوه فأنجيناه والذين معه في الفلك وأغرقنا الذين كذبوا بآياتنا إنهم كانوا قوما عمين
en: But they denied him, so We saved him and those with him in the ship, and We drowned those who denied Our tokens. Lo! they were blind folk.

source: وإلى عاد أخاهم هودا قال يا قوم اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And unto (the tribe of) A'ad (We sent) their brother, Hud. He said: O my people! Serve Allah. Ye have no other Allah save Him. Will ye not ward off (evil)?

source: قال الملأ الذين كفروا من قومه إنا لنراك في سفاهة وإنا لنظنك من الكاذبين
en: The chieftains of his people, who were disbelieving, said: Lo! we surely see thee in foolishness, and lo! we deem thee of the liars.

source: قال يا قوم ليس بي سفاهة ولكني رسول من رب العالمين
en: He said: O my people! There is no foolishness in me, but I am a messenger from the Lord of the Worlds.

source: أبلغكم رسالات ربي وأنا لكم ناصح أمين
en: I convey unto you the messages of my Lord and am for you a true adviser.

source: أوعجبتم أن جاءكم ذكر من ربكم على رجل منكم لينذركم واذكروا إذ جعلكم خلفاء من بعد قوم نوح وزادكم في الخلق بسطة فاذكروا آلاء الله لعلكم تفلحون
en: Marvel ye that there should come unto you a Reminder from your Lord by means of a man among you, that he may warn you? Remember how He made you viceroys after Noah's folk, and gave you growth of stature. Remember (all) the bounties of your Lord, that haply ye may be successful.

source: قالوا أجئتنا لنعبد الله وحده ونذر ما كان يعبد آباؤنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said: Hast come unto us that we should serve Allah alone, and forsake what our fathers worshipped? Then bring upon us that wherewith thou threatenest us if thou art of the truthful!

source: قال قد وقع عليكم من ربكم رجس وغضب أتجادلونني في أسماء سميتموها أنتم وآباؤكم ما نزل الله بها من سلطان فانتظروا إني معكم من المنتظرين
en: He said: Terror and wrath from your Lord have already fallen on you. Would ye wrangle with me over names which ye have named, ye and your fathers, for which no warrant from Allah hath been revealed? Then await (the consequence), lo! I (also) am of those awaiting (it).

source: فأنجيناه والذين معه برحمة منا وقطعنا دابر الذين كذبوا بآياتنا وما كانوا مؤمنين
en: And We saved him and those with him by a mercy from Us, and We cut the root of those who denied Our revelations and were not believers.

source: وإلى ثمود أخاهم صالحا قال يا قوم اعبدوا الله ما لكم من إله غيره قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية فذروها تأكل في أرض الله ولا تمسوها بسوء فيأخذكم عذاب أليم
en: And to (the tribe of) Thamud (We sent) their brother Salih. He said: O my people! Serve Allah. Ye have no other Allah save Him. A wonder from your Lord hath come unto you. Lo! this is the camel of Allah, a token unto you; so let her feed in Allah's earth, and touch her not with hurt lest painful torment seize you.

source: واذكروا إذ جعلكم خلفاء من بعد عاد وبوأكم في الأرض تتخذون من سهولها قصورا وتنحتون الجبال بيوتا فاذكروا آلاء الله ولا تعثوا في الأرض مفسدين
en: And remember how He made you viceroys after A'ad and gave you station in the earth. Ye choose castles in the plains and hew the mountains into dwellings. So remember (all) the bounties of Allah and do not evil, making mischief in the earth.

source: قال الملأ الذين استكبروا من قومه للذين استضعفوا لمن آمن منهم أتعلمون أن صالحا مرسل من ربه قالوا إنا بما أرسل به مؤمنون
en: The chieftains of his people, who were scornful, said unto those whom they despised, unto such of them as believed: Know ye that Salih is one sent from his Lord? They said: Lo! In that wherewith he hath been sent we are believers.

source: قال الذين استكبروا إنا بالذي آمنتم به كافرون
en: Those who were scornful said: Lo! in that which ye believe we are disbelievers.

source: فعقروا الناقة وعتوا عن أمر ربهم وقالوا يا صالح ائتنا بما تعدنا إن كنت من المرسلين
en: So they hamstrung the she-camel, and they flouted the commandment of their Lord, and they said: O Salih! Bring upon us that thou threatenest if thou art indeed of those sent (from Allah).

source: فأخذتهم الرجفة فأصبحوا في دارهم جاثمين
en: So the earthquake seized them, and morning found them prostrate in their dwelling-place.

source: فتولى عنهم وقال يا قوم لقد أبلغتكم رسالة ربي ونصحت لكم ولكن لا تحبون الناصحين
en: And (Salih) turned from them and said: O my people! I delivered my Lord's message unto you and gave you good advice, but ye love not good advisers.

source: ولوطا إذ قال لقومه أتأتون الفاحشة ما سبقكم بها من أحد من العالمين
en: And Lot! (Remember) when he said unto his folk: Will ye commit abomination such as no creature ever did before you?

source: إنكم لتأتون الرجال شهوة من دون النساء بل أنتم قوم مسرفون
en: Lo! ye come with lust unto men instead of women. Nay, but ye are wanton folk.

source: وما كان جواب قومه إلا أن قالوا أخرجوهم من قريتكم إنهم أناس يتطهرون
en: And the answer of his people was only that they said (one to another): Turn them out of your township. They are folk, forsooth, who keep pure.

source: فأنجيناه وأهله إلا امرأته كانت من الغابرين
en: And We rescued him and his household, save his wife, who was of those who stayed behind.

source: وأمطرنا عليهم مطرا فانظر كيف كان عاقبة المجرمين
en: And We rained a rain upon them. See now the nature of the consequence of evil-doers!

source: وإلى مدين أخاهم شعيبا قال يا قوم اعبدوا الله ما لكم من إله غيره قد جاءتكم بينة من ربكم فأوفوا الكيل والميزان ولا تبخسوا الناس أشياءهم ولا تفسدوا في الأرض بعد إصلاحها ذلكم خير لكم إن كنتم مؤمنين
en: And unto Midian (We sent) their brother, Shu'eyb. He said: O my people! Serve Allah. Ye have no other Allah save Him. Lo! a clear proof hath come unto you from your Lord; so give full measure and full weight and wrong not mankind in their goods, and work not confusion in the earth after the fair ordering thereof. That will be better for you, if ye are believers.

source: ولا تقعدوا بكل صراط توعدون وتصدون عن سبيل الله من آمن به وتبغونها عوجا واذكروا إذ كنتم قليلا فكثركم وانظروا كيف كان عاقبة المفسدين
en: Lurk not on every road to threaten (wayfarers), and to turn away from Allah's path him who believeth in Him, and to seek to make it crooked. And remember, when ye were but few, how He did multiply you. And see the nature of the consequence for the corrupters!

source: وإن كان طائفة منكم آمنوا بالذي أرسلت به وطائفة لم يؤمنوا فاصبروا حتى يحكم الله بيننا وهو خير الحاكمين
en: And if there is a party of you which believeth in that wherewith I have been sent, and there is a party which believeth not, then have patience until Allah judge between us. He is the Best of all who deal in judgment.

source: قال الملأ الذين استكبروا من قومه لنخرجنك يا شعيب والذين آمنوا معك من قريتنا أو لتعودن في ملتنا قال أولو كنا كارهين
en: The chieftains of his people, who were scornful, said: Surely we will drive thee out, O Shu'eyb, and those who believe with thee, from our township, unless ye return to our religion. He said: Even though we hate it?

source: قد افترينا على الله كذبا إن عدنا في ملتكم بعد إذ نجانا الله منها وما يكون لنا أن نعود فيها إلا أن يشاء الله ربنا وسع ربنا كل شيء علما على الله توكلنا ربنا افتح بيننا وبين قومنا بالحق وأنت خير الفاتحين
en: We should have invented a lie against Allah if we returned to your religion after Allah hath rescued us from it. It is not for us to return to it unless Allah our Lord should (so) will. Our Lord comprehendeth all things in knowledge. In Allah do we put our trust. Our Lord! Decide with truth between us and our folk, for Thou art the best of those who make decision.

source: وقال الملأ الذين كفروا من قومه لئن اتبعتم شعيبا إنكم إذا لخاسرون
en: But the chieftains of his people, who were disbelieving, said: If ye follow Shu'eyb, then truly ye shall be the losers.

source: الذين كذبوا شعيبا كأن لم يغنوا فيها الذين كذبوا شعيبا كانوا هم الخاسرين
en: Those who denied Shu'eyb became as though they had not dwelt there. Those who denied Shu'eyb, they were the losers.

source: فتولى عنهم وقال يا قوم لقد أبلغتكم رسالات ربي ونصحت لكم فكيف آسى على قوم كافرين
en: So he turned from them and said: O my people! I delivered my Lord's messages unto you and gave you good advice; then how can I sorrow for a people that rejected (truth)?

source: وما أرسلنا في قرية من نبي إلا أخذنا أهلها بالبأساء والضراء لعلهم يضرعون
en: And We sent no prophet unto any township but We did afflict its folk with tribulation and adversity that haply they might grow humble.

source: ثم بدلنا مكان السيئة الحسنة حتى عفوا وقالوا قد مس آباءنا الضراء والسراء فأخذناهم بغتة وهم لا يشعرون
en: Then changed We the evil plight for good till they grew affluent and said: Tribulation and distress did touch our fathers. Then We seized them unawares, when they perceived not.

source: ولو أن أهل القرى آمنوا واتقوا لفتحنا عليهم بركات من السماء والأرض ولكن كذبوا فأخذناهم بما كانوا يكسبون
en: And if the people of the townships had believed and kept from evil, surely We should have opened for them blessings from the sky and from the earth. But (unto every messenger) they gave the lie, and so We seized them on account of what they used to earn.

source: أفأمن أهل القرى أن يأتيهم بأسنا بياتا وهم نائمون
en: Are the people of the townships then secure from the coming of Our wrath upon them as a night-raid while they sleep?

source: أوأمن أهل القرى أن يأتيهم بأسنا ضحى وهم يلعبون
en: Or are the people of the townships then secure from the coming of Our wrath upon them in the daytime while they play?

source: أفأمنوا مكر الله فلا يأمن مكر الله إلا القوم الخاسرون
en: Are they then secure from Allah's scheme? None deemeth himself secure from Allah's scheme save folk that perish.

source: أولم يهد للذين يرثون الأرض من بعد أهلها أن لو نشاء أصبناهم بذنوبهم ونطبع على قلوبهم فهم لا يسمعون
en: Is it not an indication to those who inherit the land after its people (who thus reaped the consequence of evil-doing) that, if We will, We can smite them for their sins and print upon their hearts so that they hear not?

source: تلك القرى نقص عليك من أنبائها ولقد جاءتهم رسلهم بالبينات فما كانوا ليؤمنوا بما كذبوا من قبل كذلك يطبع الله على قلوب الكافرين
en: Such were the townships. We relate some tidings of them unto thee (Muhammad). Their messengers verily came unto them with clear proofs (of Allah's Sovereignty), but they could not believe because they had before denied. Thus doth Allah print upon the hearts of disbelievers (that they hear not).

source: وما وجدنا لأكثرهم من عهد وإن وجدنا أكثرهم لفاسقين
en: We found no (loyalty to any) covenant in most of them. Nay, most of them We found wrong-doers.

source: ثم بعثنا من بعدهم موسى بآياتنا إلى فرعون وملئه فظلموا بها فانظر كيف كان عاقبة المفسدين
en: Then, after them, We sent Moses with our tokens unto Pharaoh and his chiefs, but they repelled them. Now, see the nature of the consequence for the corrupters!

source: وقال موسى يا فرعون إني رسول من رب العالمين
en: Moses said: O Pharaoh! Lo! I am a messenger from the Lord of the Worlds,

source: حقيق على أن لا أقول على الله إلا الحق قد جئتكم ببينة من ربكم فأرسل معي بني إسرائيل
en: Approved upon condition that I speak concerning Allah nothing but the truth. I come unto you (lords of Egypt) with a clear proof from your Lord. So let the Children of Israel go with me.

source: قال إن كنت جئت بآية فأت بها إن كنت من الصادقين
en: (Pharaoh) said: If thou comest with a token, then produce it, if thou art of those who speak the truth.

source: فألقى عصاه فإذا هي ثعبان مبين
en: Then he flung down his staff and lo! it was a serpent manifest;

source: ونزع يده فإذا هي بيضاء للناظرين
en: And he drew forth his hand (from his bosom), and lo! it was white for the beholders.

source: قال الملأ من قوم فرعون إن هذا لساحر عليم
en: The chiefs of Pharaoh's people said: Lo! this is some knowing wizard,

source: يريد أن يخرجكم من أرضكم فماذا تأمرون
en: Who would expel you from your land. Now what do ye advise?

source: قالوا أرجه وأخاه وأرسل في المدائن حاشرين
en: They said (unto Pharaoh): Put him off (a while) - him and his brother - and send into the cities summoners,

source: يأتوك بكل ساحر عليم
en: To bring each knowing wizard unto thee.

source: وجاء السحرة فرعون قالوا إن لنا لأجرا إن كنا نحن الغالبين
en: And the wizards came to Pharaoh, saying: Surely there will be a reward for us if we are victors.

source: قال نعم وإنكم لمن المقربين
en: He answered: Yes, and surely ye shall be of those brought near (to me).

source: قالوا يا موسى إما أن تلقي وإما أن نكون نحن الملقين
en: They said: O Moses! Either throw (first) or let us be the first throwers?

source: قال ألقوا فلما ألقوا سحروا أعين الناس واسترهبوهم وجاءوا بسحر عظيم
en: He said: Throw! And when they threw they cast a spell upon the people's eyes, and overawed them, and produced a mighty spell.

source: وأوحينا إلى موسى أن ألق عصاك فإذا هي تلقف ما يأفكون
en: And We inspired Moses (saying): Throw thy staff! And lo! it swallowed up their lying show.

source: فوقع الحق وبطل ما كانوا يعملون
en: Thus was the Truth vindicated and that which they were doing was made vain.

source: فغلبوا هنالك وانقلبوا صاغرين
en: Thus were they there defeated and brought low.

source: وألقي السحرة ساجدين
en: And the wizards fell down prostrate,

source: قالوا آمنا برب العالمين
en: Crying: We believe in the Lord of the Worlds,

source: رب موسى وهارون
en: The Lord of Moses and Aaron.

source: قال فرعون آمنتم به قبل أن آذن لكم إن هذا لمكر مكرتموه في المدينة لتخرجوا منها أهلها فسوف تعلمون
en: Pharaoh said: Ye believe in Him before I give you leave! Lo! this is the plot that ye have plotted in the city that ye may drive its people hence. But ye shall come to know!

source: لأقطعن أيديكم وأرجلكم من خلاف ثم لأصلبنكم أجمعين
en: Surely I shall have your hands and feet cut off upon alternate sides. Then I shall crucify you every one.

source: قالوا إنا إلى ربنا منقلبون
en: They said: Lo! We are about to return unto our Lord!

source: وما تنقم منا إلا أن آمنا بآيات ربنا لما جاءتنا ربنا أفرغ علينا صبرا وتوفنا مسلمين
en: Thou takest vengeance on us only forasmuch as we believed the tokens of our Lord when they came unto us. Our Lord! Vouchsafe unto us steadfastness and make us die as men who have surrendered (unto Thee).

source: وقال الملأ من قوم فرعون أتذر موسى وقومه ليفسدوا في الأرض ويذرك وآلهتك قال سنقتل أبناءهم ونستحيي نساءهم وإنا فوقهم قاهرون
en: The chiefs of Pharaoh's people said: (O King), wilt thou suffer Moses and his people to make mischief in the land, and flout thee and thy gods? He said: We will slay their sons and spare their women, for lo! we are in power over them.

source: قال موسى لقومه استعينوا بالله واصبروا إن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين
en: And Moses said unto his people: Seek help in Allah and endure. Lo! the earth is Allah's. He giveth it for an inheritance to whom He will. And lo! the sequel is for those who keep their duty (unto Him).

source: قالوا أوذينا من قبل أن تأتينا ومن بعد ما جئتنا قال عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض فينظر كيف تعملون
en: They said: We suffered hurt before thou camest unto us, and since thou hast come unto us. He said: It may be that your Lord is going to destroy your adversary and make you viceroys in the earth, that He may see how ye behave.

source: ولقد أخذنا آل فرعون بالسنين ونقص من الثمرات لعلهم يذكرون
en: And we straitened Pharaoh's folk with famine and dearth of fruits, that peradventure they might heed.

source: فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئة يطيروا بموسى ومن معه ألا إنما طائرهم عند الله ولكن أكثرهم لا يعلمون
en: But whenever good befell them, they said: This is ours; and whenever evil smote them they ascribed it to the evil auspices of Moses and those with him. Surely their evil auspice was only with Allah. But most of them knew not.

source: وقالوا مهما تأتنا به من آية لتسحرنا بها فما نحن لك بمؤمنين
en: And they said: Whatever portent thou bringest wherewith to bewitch us, we shall not put faith in thee.

source: فأرسلنا عليهم الطوفان والجراد والقمل والضفادع والدم آيات مفصلات فاستكبروا وكانوا قوما مجرمين
en: So We sent against them the flood and the locusts and the vermin and the frogs and the blood - a succession of clear signs. But they were arrogant and became a guilty folk.

source: ولما وقع عليهم الرجز قالوا يا موسى ادع لنا ربك بما عهد عندك لئن كشفت عنا الرجز لنؤمنن لك ولنرسلن معك بني إسرائيل
en: And when the terror fell on them they cried: O Moses! Pray for us unto thy Lord, because He hath a covenant with thee. If thou removest the terror from us we verily will trust thee and will let the Children of Israel go with thee.

source: فلما كشفنا عنهم الرجز إلى أجل هم بالغوه إذا هم ينكثون
en: But when We did remove from them the terror for a term which they must reach, behold! they broke their covenant.

source: فانتقمنا منهم فأغرقناهم في اليم بأنهم كذبوا بآياتنا وكانوا عنها غافلين
en: Therefore We took retribution from them; therefore We drowned them in the sea: because they denied Our revelations and were heedless of them.

source: وأورثنا القوم الذين كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها وتمت كلمت ربك الحسنى على بني إسرائيل بما صبروا ودمرنا ما كان يصنع فرعون وقومه وما كانوا يعرشون
en: And We caused the folk who were despised to inherit the eastern parts of the land and the western parts thereof which We had blessed. And the fair word of thy Lord was fulfilled for the Children of Israel because of their endurance; and We annihilated (all) that Pharaoh and his folk had done and that they had contrived.

source: وجاوزنا ببني إسرائيل البحر فأتوا على قوم يعكفون على أصنام لهم قالوا يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون
en: And We brought the Children of Israel across the sea, and they came unto a people who were given up to idols which they had. They said: O Moses! Make for us a god even as they have gods. He said: Lo! ye are a folk who know not.

source: إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون
en: Lo! as for these, their way will be destroyed and all that they are doing is in vain.

source: قال أغير الله أبغيكم إلها وهو فضلكم على العالمين
en: He said: Shall I seek for you a god other than Allah when He hath favoured you above (all) creatures?

source: وإذ أنجيناكم من آل فرعون يسومونكم سوء العذاب يقتلون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم
en: And (remember) when We did deliver you from Pharaoh's folk who were afflicting you with dreadful torment, slaughtering your sons and sparing your women. That was a tremendous trial from your Lord.

source: وواعدنا موسى ثلاثين ليلة وأتممناها بعشر فتم ميقات ربه أربعين ليلة وقال موسى لأخيه هارون اخلفني في قومي وأصلح ولا تتبع سبيل المفسدين
en: And when We did appoint for Moses thirty nights (of solitude), and added to them ten, and he completed the whole time appointed by his Lord of forty nights; and Moses said unto his brother, Aaron: Take my place among the people. Do right, and follow not the way of mischief-makers.
